In [1]:
import pandas as pd

In [2]:
df = pd.read_excel(r'Week_04_HW4_Titanic_Data.xls')
df.head()

,Survived,Passenger Class,Name,Sex,Age,No of Siblings or Spouses on Board,No of Parents or Children on Board,Ticket Number,Passenger Fare,Cabin,Port of Embarkation,Life Boat
0,Yes,First,"Allen, Miss. Elisabeth Walton",Female,29.0000,0,0,24160,211.3375,B5,Southampton,2
1,Yes,First,"Allison, Master. Hudson Trevor",Male,0.9167,1,2,113781,151.5500,C22 C26,Southampton,11
2,No,First,"Allison, Miss. Helen Loraine",Female,2.0000,1,2,113781,151.5500,C22 C26,Southampton,NaN
3,No,First,"Allison, Mr. Hudson Joshua Creighton",Male,30.0000,1,2,113781,151.5500,C22 C26,Southampton,NaN
4,No,First,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",Female,25.0000,1,2,113781,151.5500,C22 C26,Southampton,NaN

In [3]:
# checking for null
df.isnull().sum()

Survived                                 0
Passenger Class                          0
Name                                     0
Sex                                      0
Age                                    263
No of Siblings or Spouses on Board       0
No of Parents or Children on Board       0
Ticket Number                            0
Passenger Fare                           1
Cabin                                 1014
Port of Embarkation                      2
Life Boat                              823
dtype: int64

In [4]:
# Fill missing values in the "Age" column with the mean
df['Age'].fillna(df['Age'].mean(), inplace=True)

In [5]:
# Fill missing values in the "Passenger Fare" column with the mean
df['Passenger Fare'].fillna(df['Passenger Fare'].mean(), inplace=True)

In [6]:

# Fill missing values in the "Cabin" column with "Unknown"
df['Cabin'].fillna("Unknown", inplace=True)

In [7]:
# Fill missing values in the "Port of Embarkation" column with the mode
df['Port of Embarkation'].fillna(df['Port of Embarkation'].mode()[0], inplace=True)

In [8]:
# Drop missing values in the "Life Boat" column
df.dropna(subset=['Life Boat'], inplace=True)

In [9]:
# Check for missing values again
print(df.isnull().sum())

Survived                              0
Passenger Class                       0
Name                                  0
Sex                                   0
Age                                   0
No of Siblings or Spouses on Board    0
No of Parents or Children on Board    0
Ticket Number                         0
Passenger Fare                        0
Cabin                                 0
Port of Embarkation                   0
Life Boat                             0
dtype: int64